In [14]:
import pandas as pd

success = pd.Series(['goal', 'risk', 'skill', 'courage'])

print(success)

0       goal
1       risk
2      skill
3    courage
dtype: object

In [15]:
#creating series with a numpy array

success_list = np.array(['goal', 'risk', 'skill', 'courage'])
numpy_success = pd.Series(success_list)
print(numpy_success)

0       goal
1       risk
2      skill
3    courage
dtype: object

In [8]:
#using string as index 

success = pd.Series(['goal', 'risk', 'skill', 'courage'],
                    index=['a', 'b', 'c', 'd'])


#create series from a dictionary 
success1 = pd.Series({'a':'goal', 'b':'risk', 'c':'skill', 'd':'courage'})

print(success)
print(success1)

a       goal
b       risk
c      skill
d    courage
dtype: object
a       goal
b       risk
c      skill
d    courage
dtype: object

In [13]:
success[0], success[1],success[2], success[3]

('goal', 'risk', 'skill', 'courage')

In [14]:
success[1:]

b       risk
c      skill
d    courage
dtype: object

In [15]:
success['b']

'risk'

In [16]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [36]:
# create a dataframe from a dictionary

df_dict ={'Country':['Ghana', 'Kenya', 'Nigeria', 'Togo'],
          'Capital':['Accra', 'Nairobi', 'Abuja', 'Lome'],
          'Population':[12000, 8700, 14000, 7500],
          'Age':[65, 72, 75, 61]}
          
df = pd.DataFrame(df_dict, index = [2, 4, 6, 8])

print(df)

   Country  Capital  Population  Age
2    Ghana    Accra       12000   65
4    Kenya  Nairobi        8700   72
6  Nigeria    Abuja       14000   75
8     Togo     Lome        7500   61

In [37]:
df_list = [['Ghana', 'Accra', 12000, 65], 
           ['Kenya', 'Nairobi', 8700, 72], 
           ['Nigeria', 'Abuja', 14000, 75], 
           ['Togo', 'Lome', 7500, 61]]

df1 = pd.DataFrame(df_list, columns = ['Country','Capital','Population','Age'], index = [2, 4, 6, 8])
print(df1)

   Country  Capital  Population  Age
2    Ghana    Accra       12000   65
4    Kenya  Nairobi        8700   72
6  Nigeria    Abuja       14000   75
8     Togo     Lome        7500   61

In [39]:
df.iloc[3]

Country       Togo
Capital       Lome
Population    7500
Age             61
Name: 8, dtype: object

In [41]:
df.loc[6]

Country       Nigeria
Capital         Abuja
Population      14000
Age                75
Name: 6, dtype: object

In [42]:
df['Capital']

2      Accra
4    Nairobi
6      Abuja
8       Lome
Name: Capital, dtype: object

In [43]:
df.at[6, 'Country']

'Nigeria'

In [44]:
df.iat[2,0]

'Nigeria'

In [45]:
df['Population'].sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of 2    12000
4     8700
6    14000
8     7500
Name: Population, dtype: int64>

In [46]:
df['Population'].sum()

42200

In [47]:
df.mean()

Population    10550.00
Age              68.25
dtype: float64

In [48]:
df.describe()

         Population        Age
count      4.000000   4.000000
mean   10550.000000  68.250000
std     2984.962311   6.396614
min     7500.000000  61.000000
25%     8400.000000  64.000000
50%    10350.000000  68.500000
75%    12500.000000  72.750000
max    14000.000000  75.000000

In [62]:
df_dict2 = {'Name':['James','Yen','Cairo', np.nan],'Profession': ['Reseacher','Artist', 'Doctor', 'Writer'],
            'Experience':[12, np.nan, 10, 8],'Height':[np.nan, 175,180, 150]}

new_df = pd.DataFrame(df_dict2)
print(new_df)

    Name Profession  Experience  Height
0  James  Reseacher        12.0     NaN
1    Yen     Artist         NaN   175.0
2  Cairo     Doctor        10.0   180.0
3    NaN     Writer         8.0   150.0

In [63]:
new_df.isnull()

    Name  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

In [64]:
new_df.dropna()

    Name Profession  Experience  Height
2  Cairo     Doctor        10.0   180.0